Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericAxisPrefix
The Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericAxisPrefix enum defines the axis prefix used in numeric input.
Indicates which axis values are forced to use, values without axis prefix given should remain same.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericAxisPrefix.None
No axis prefix is in use, legacy numeric input handling

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericAxisPrefix.AxisX
Axis X value should be used

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericAxisPrefix.AxisY
Axis Y value should be used

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericAxisPrefix.AxisZ
Axis Z value should be used